MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CX0525SG12144/mcu.h
/*
 * Header file for PIC32CX0525SG12144
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* File generated from device description file (ATDF) version 2020-03-24T11:15:30Z */
#ifndef _PIC32CX0525SG12144_H_
#define _PIC32CX0525SG12144_H_

/* Header version uses Semantic Versioning 2.0.0 (https://semver.org/) */
#define HEADER_FORMAT_VERSION "2.1.1"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (1)
#define HEADER_FORMAT_VERSION_PATCH (1)

/* PIC32CX0525SG12144 definitions
  This file defines all structures and symbols for PIC32CX0525SG12144:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_UINT8_) || defined(_UINT16_) || defined(_UINT32_)
#    error "Integer constant value macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with sizes of integer constants for C/C++ */
#  define _UINT8_(x)   ((uint8_t)(x))    /* C code: 8-bits unsigned integer constant value */
#  define _UINT16_(x)  ((uint16_t)(x))   /* C code: 16-bits unsigned integer constant value */
#  define _UINT32_(x)  ((uint32_t)(x))   /* C code: 32-bits unsigned integer constant value */

#else /* Assembler */

#  define _UINT8_(x) x    /* Assembler: 8-bits unsigned integer constant value */
#  define _UINT16_(x) x   /* Assembler: 16-bits unsigned integer constant value */
#  define _UINT32_(x) x   /* Assembler: 32-bits unsigned integer constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */

/* ************************************************************************** */
/* CMSIS DEFINITIONS FOR PIC32CX0525SG12144                                 */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M4 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /* -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /* -13 Hard Fault, all classes of Fault    */
  BusFault_IRQn             = -11, /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn           = -10, /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SVCall_IRQn               =  -5, /* -5  System Service Call via SVC instruction */
  DebugMonitor_IRQn         =  -4, /* -4  Debug Monitor                       */
  PendSV_IRQn               =  -2, /* -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /* -1  System Tick Timer                   */

/******  PIC32CX0525SG12144 specific Interrupt Numbers ***********************************/
  GIRQ08_IRQn               =   0, /* 0   GPIO Pin Control Registers (GPIO)   */
  GIRQ09_IRQn               =   1, /* 1   GPIO Pin Control Registers (GPIO)   */
  GIRQ10_IRQn               =   2, /* 2   GPIO Pin Control Registers (GPIO)   */
  GIRQ11_IRQn               =   3, /* 3   GPIO Pin Control Registers (GPIO)   */
  GIRQ12_IRQn               =   4, /* 4   GPIO Pin Control Registers (GPIO)   */
  GIRQ13_IRQn               =   5, /* 5   The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB0) */
  GIRQ14_IRQn               =   6, /* 6   DMA Channel 00 Registers (DMA_CHAN00) */
  GIRQ15_IRQn               =   7, /* 7   The 16550 UART is a full-function Two Pin Serial Port that supports the standard RS-232 Interface. (UART0) */
  GIRQ16_IRQn               =   8, /* 8   Crypto block interrupt (PKE_ERR)    */
  GIRQ17_IRQn               =   9, /* 9   The PECI Interface allows the EC to retrieve temperature readings from PECI-compliant devices. (PECI) */
  GIRQ18_IRQn               =  10, /* 10  The QMSPI may be used to communicate with various peripheral devices that use a Serial Peripheral Interface (QMSPI) */
  GIRQ19_IRQn               =  11, /* 11  The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  GIRQ20_IRQn               =  12, /* 12  OTP Programming registers.\n (OTP)  */
  GIRQ21_IRQn               =  13, /* 13  The function of the Watchdog Timer is to provide a mechanism to detect if the internal embedded controller has failed. (WDT) */
  GIRQ23_IRQn               =  14, /* 14  This 16-bit timer block offers a simple mechanism for firmware to maintain a time base (TIMER16_0) */
  GIRQ24_IRQn               =  15, /* 15  The ESPI VW Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC (ESPI_MSVW00_06) */
  GIRQ25_IRQn               =  16, /* 16  The ESPI VW Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC (ESPI_MSVW07_10) */
  GIRQ26_IRQn               =  17, /* 17  GPIO Pin Control Registers (GPIO)   */
  I2CSMB0_IRQn              =  20, /* 20  The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB0) */
  I2CSMB1_IRQn              =  21, /* 21  The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB1) */
  I2CSMB2_IRQn              =  22, /* 22  The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB2) */
  I2CSMB3_IRQn              =  23, /* 23  The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB3) */
  DMA_CH00_IRQn             =  24, /* 24  DMA Channel 00 Registers (DMA_CHAN00) */
  DMA_CH01_IRQn             =  25, /* 25  DMA Channel 01 Registers (DMA_CHAN01) */
  DMA_CH02_IRQn             =  26, /* 26  DMA Channel 02 Registers (DMA_CHAN02) */
  DMA_CH03_IRQn             =  27, /* 27  DMA Channel 02 Registers (DMA_CHAN03) */
  DMA_CH04_IRQn             =  28, /* 28  DMA Channel 02 Registers (DMA_CHAN04) */
  DMA_CH05_IRQn             =  29, /* 29  DMA Channel 02 Registers (DMA_CHAN05) */
  DMA_CH06_IRQn             =  30, /* 30  DMA Channel 02 Registers (DMA_CHAN06) */
  DMA_CH07_IRQn             =  31, /* 31  DMA Channel 02 Registers (DMA_CHAN07) */
  DMA_CH08_IRQn             =  32, /* 32  DMA Channel 02 Registers (DMA_CHAN08) */
  DMA_CH09_IRQn             =  33, /* 33  DMA Channel 02 Registers (DMA_CHAN09) */
  DMA_CH10_IRQn             =  34, /* 34  DMA Channel 02 Registers (DMA_CHAN10) */
  DMA_CH11_IRQn             =  35, /* 35  DMA Channel 02 Registers (DMA_CHAN11) */
  UART0_IRQn                =  40, /* 40  The 16550 UART is a full-function Two Pin Serial Port that supports the standard RS-232 Interface. (UART0) */
  UART1_IRQn                =  41, /* 41  The 16550 UART is a full-function Two Pin Serial Port that supports the standard RS-232 Interface. (UART1) */
  EMI0_IRQn                 =  42, /* 42  The EMI provides a communication between system host and Embedded Controller (EMI0) */
  EMI1_IRQn                 =  43, /* 43  The EMI provides a communication between system host and Embedded Controller (EMI1) */
  UART2_IRQn                =  44, /* 44  The 16550 UART is a full-function Two Pin Serial Port that supports the standard RS-232 Interface. (UART2) */
  AEC0_IBF_IRQn             =  45, /* 45  The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC0) */
  AEC0_OBE_IRQn             =  46, /* 46  The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC0) */
  AEC1_IBF_IRQn             =  47, /* 47  The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC1) */
  AEC1_OBE_IRQn             =  48, /* 48  The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC1) */
  AEC2_IBF_IRQn             =  49, /* 49  The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC2) */
  AEC2_OBE_IRQn             =  50, /* 50  The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC2) */
  AEC3_IBF_IRQn             =  51, /* 51  The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC3) */
  AEC3_OBE_IRQn             =  52, /* 52  The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC3) */
  APM1_CTL_IRQn             =  55, /* 55  These features comply with the ACPI Specification through a combination of hardware and EC software (PM1) */
  APM1_EN_IRQn              =  56, /* 56  These features comply with the ACPI Specification through a combination of hardware and EC software (PM1) */
  APM1_STS_IRQn             =  57, /* 57  These features comply with the ACPI Specification through a combination of hardware and EC software (PM1) */
  KBC_OBE_IRQn              =  58, /* 58  The Keyboard Controller is a Host/EC Message Interface with hardware assists to emulate 8042 behavior (KBC) */
  KBC_IBF_IRQn              =  59, /* 59  The Keyboard Controller is a Host/EC Message Interface with hardware assists to emulate 8042 behavior (KBC) */
  MBOX_IRQn                 =  60, /* 60  The Mailbox provides a standard run-time mechanism for the host to communicate with the Embedded Controller (EC). (MBX) */
  P80CAP0_IRQn              =  62, /* 62  Diagnostic data is written by the Host Interface to the Port 80 BIOS Debug Port (PORT_80_DEBUG0) */
  P80CAP1_IRQn              =  63, /* 63  Diagnostic data is written by the Host Interface to the Port 80 BIOS Debug Port (PORT_80_DEBUG1) */
  PKE_ERR_IRQn              =  65, /* 65  Crypto block interrupt (PKE_ERR)    */
  PKE_END_IRQn              =  66, /* 66  Crypto block interrupt (PKE_END)    */
  RNG_IRQn                  =  67, /* 67  Crypto block interrupt (RNG)        */
  AES_IRQn                  =  68, /* 68  Crypto block interrupt (AES)        */
  HASH_IRQn                 =  69, /* 69  Crypto block interrupt (HASH)       */
  PECI_IRQn                 =  70, /* 70  The PECI Interface allows the EC to retrieve temperature readings from PECI-compliant devices. (PECI) */
  TACH0_IRQn                =  71, /* 71  This block monitors TACH output signals from various types of fans, and determines their speed. (TACH0) */
  TACH1_IRQn                =  72, /* 72  This block monitors TACH output signals from various types of fans, and determines their speed. (TACH1) */
  TACH2_IRQn                =  73, /* 73  This block monitors TACH output signals from various types of fans, and determines their speed. (TACH2) */
  ADC_SNGL_IRQn             =  78, /* 78  This block is designed to convert external analog voltage readings into digital values. (ADC) */
  ADC_RPT_IRQn              =  79, /* 79  This block is designed to convert external analog voltage readings into digital values. (ADC) */
  LED0_IRQn                 =  83, /* 83  The LED is implemented using a PWM that can be driven either by the 48 MHz clock or by a 32.768 KHz clock input. (LED0) */
  LED1_IRQn                 =  84, /* 84  The LED is implemented using a PWM that can be driven either by the 48 MHz clock or by a 32.768 KHz clock input. (LED1) */
  LED2_IRQn                 =  85, /* 85  The LED is implemented using a PWM that can be driven either by the 48 MHz clock or by a 32.768 KHz clock input. (LED2) */
  PHOT_IRQn                 =  87, /* 87  This block monitors the PROCHOT# signal generated by the host processor. It is designed to detect single assertions and monitor cumulative PROCHOT active time. (PHOT) */
  SPISLV_IRQn               =  90, /* 90  SPI Slave Register. (SPI_SLAVE)     */
  QMSPI_IRQn                =  91, /* 91  The QMSPI may be used to communicate with various peripheral devices that use a Serial Peripheral Interface (QMSPI) */
  PS2_0_ACT_IRQn            = 100, /* 100 The four PS/2 Ports implementation eliminates the need to bit bang I/O ports to generate PS/2 traffic (PS2_0) */
  PS2_1_ACT_IRQn            = 101, /* 101 The four PS/2 Ports implementation eliminates the need to bit bang I/O ports to generate PS/2 traffic (PS2_1) */
  INTR_PC_IRQn              = 103, /* 103 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  INTR_BM1_IRQn             = 104, /* 104 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  INTR_BM2_IRQn             = 105, /* 105 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  INTR_LTR_IRQn             = 106, /* 106 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  INTR_OOB_UP_IRQn          = 107, /* 107 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  INTR_OOB_DOWN_IRQn        = 108, /* 108 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  INTR_FLASH_IRQn           = 109, /* 109 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  ESPI_RESET_IRQn           = 110, /* 110 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  TMR_IRQn                  = 111, /* 111 RTOS is a 32-bit timer designed to operate on the 32kHz oscillator which is available during all chip sleep states. (RTOS) */
  HTMR0_IRQn                = 112, /* 112 The Hibernation Timer can generate a wake event to the Embedded Controller (EC) when it is in a hibernation mode (HTM0) */
  HTMR1_IRQn                = 113, /* 113 The Hibernation Timer can generate a wake event to the Embedded Controller (EC) when it is in a hibernation mode (HTM1) */
  WK_IRQn                   = 114, /* 114 The Week Timer and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state (WEEK) */
  WKSUB_IRQn                = 115, /* 115 The Week Timer and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state (WEEK) */
  WKSEC_IRQn                = 116, /* 116 The Week Timer and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state (WEEK) */
  WKSUBSEC_IRQn             = 117, /* 117 The Week Timer and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state (WEEK) */
  SYSPWR_IRQn               = 118, /* 118 The Week Timer and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state (WEEK) */
  RTC_IRQn                  = 119, /* 119 This is the set of registers that are automatically counted by hardware every 1 second while the block is enabled (RTC) */
  RTC_ALARM_IRQn            = 120, /* 120 This is the set of registers that are automatically counted by hardware every 1 second while the block is enabled (RTC) */
  VCI_OVRD_IN_IRQn          = 121, /* 121 The VBAT-Powered Control Interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. (VCI) */
  VCI_IN0_IRQn              = 122, /* 122 The VBAT-Powered Control Interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. (VCI) */
  VCI_IN1_IRQn              = 123, /* 123 The VBAT-Powered Control Interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. (VCI) */
  VCI_IN2_IRQn              = 124, /* 124 The VBAT-Powered Control Interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. (VCI) */
  VCI_IN3_IRQn              = 125, /* 125 The VBAT-Powered Control Interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. (VCI) */
  PS2_0A_WAKE_IRQn          = 129, /* 129 The four PS/2 Ports implementation eliminates the need to bit bang I/O ports to generate PS/2 traffic (PS2_0) */
  PS2_0B_WAKE_IRQn          = 130, /* 130 The four PS/2 Ports implementation eliminates the need to bit bang I/O ports to generate PS/2 traffic (PS2_0) */
  PS2_1B_WAKE_IRQn          = 132, /* 132 The four PS/2 Ports implementation eliminates the need to bit bang I/O ports to generate PS/2 traffic (PS2_1) */
  KEYSCAN_IRQn              = 135, /* 135 The Keyboard Scan Interface block provides a register interface to directly scan an external keyboard matrix of size up to 18x8. (KMS) */
  TIMER16_0_IRQn            = 136, /* 136 This 16-bit timer block offers a simple mechanism for firmware to maintain a time base (TIMER16_0) */
  TIMER16_1_IRQn            = 137, /* 137 This 16-bit timer block offers a simple mechanism for firmware to maintain a time base (TIMER16_1) */
  TIMER32_0_IRQn            = 140, /* 140 This 32-bit timer block offers a simple mechanism for firmware to maintain a time base (TIMER32_0) */
  TIMER32_1_IRQn            = 141, /* 141 This 32-bit timer block offers a simple mechanism for firmware to maintain a time base (TIMER32_1) */
  CCT_IRQn                  = 146, /* 146 This is a 16-bit auto-reloading timer/counter. (CCT) */
  CCT_CAP0_IRQn             = 147, /* 147 This is a 16-bit auto-reloading timer/counter. (CCT) */
  CCT_CAP1_IRQn             = 148, /* 148 This is a 16-bit auto-reloading timer/counter. (CCT) */
  CCT_CAP2_IRQn             = 149, /* 149 This is a 16-bit auto-reloading timer/counter. (CCT) */
  CCT_CAP3_IRQn             = 150, /* 150 This is a 16-bit auto-reloading timer/counter. (CCT) */
  CCT_CAP4_IRQn             = 151, /* 151 This is a 16-bit auto-reloading timer/counter. (CCT) */
  CCT_CAP5_IRQn             = 152, /* 152 This is a 16-bit auto-reloading timer/counter. (CCT) */
  CCT_CMP0_IRQn             = 153, /* 153 This is a 16-bit auto-reloading timer/counter. (CCT) */
  CCT_CMP1_IRQn             = 154, /* 154 This is a 16-bit auto-reloading timer/counter. (CCT) */
  ESPI_VWIRE_IRQn           = 156, /* 156 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  I2CSMB4_IRQn              = 158, /* 158 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB4) */
  TACH3_IRQn                = 159, /* 159 This block monitors TACH output signals from various types of fans, and determines their speed. (TACH3) */
  CEC_IRQn                  = 160, /* 160 The HDMI-CEC provides high-level control functions between all the various audiovisual products in a users environment. (HDMI_CEC) */
  SGPIO0_IRQn               = 161, /* 161 This is Serial General Purpous Input Output block (SGPIO0) */
  SGPIO1_IRQn               = 162, /* 162 This is Serial General Purpous Input Output block (SGPIO1) */
  SGPIO2_IRQn               = 163, /* 163 This is Serial General Purpous Input Output block (SGPIO2) */
  SGPIO3_IRQn               = 164, /* 164 This is Serial General Purpous Input Output block (SGPIO3) */
  SAF_DONE_IRQn             = 166, /* 166 SAF BRIDGE COMPONENT (SAFBC)        */
  SAF_ERR_IRQn              = 167, /* 167 SAF BRIDGE COMPONENT (SAFBC)        */
  I2C0_IRQn                 = 168, /* 168 The I2C interface can handle standard I2C interface. (I2C0) */
  I2C1_IRQn                 = 169, /* 169 The I2C interface can handle standard I2C interface. (I2C1) */
  I2C2_IRQn                 = 170, /* 170 The I2C interface can handle standard I2C interface. (I2C2) */
  WDT_IRQn                  = 171, /* 171 The function of the Watchdog Timer is to provide a mechanism to detect if the internal embedded controller has failed. (WDT) */

  PERIPH_MAX_IRQn           = 171  /* Max peripheral ID */
} IRQn_Type;
