MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CX0525SG12144/mcu.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* CORTEX-M4 handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pvReservedC12;
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnGIRQ08_Handler;                       /*   0 GPIO Pin Control Registers (GPIO) */
  void* pfnGIRQ09_Handler;                       /*   1 GPIO Pin Control Registers (GPIO) */
  void* pfnGIRQ10_Handler;                       /*   2 GPIO Pin Control Registers (GPIO) */
  void* pfnGIRQ11_Handler;                       /*   3 GPIO Pin Control Registers (GPIO) */
  void* pfnGIRQ12_Handler;                       /*   4 GPIO Pin Control Registers (GPIO) */
  void* pfnGIRQ13_Handler;                       /*   5 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB0) */
  void* pfnGIRQ14_Handler;                       /*   6 DMA Channel 00 Registers (DMA_CHAN00) */
  void* pfnGIRQ15_Handler;                       /*   7 The 16550 UART is a full-function Two Pin Serial Port that supports the standard RS-232 Interface. (UART0) */
  void* pfnGIRQ16_Handler;                       /*   8 Crypto block interrupt (PKE_ERR) */
  void* pfnGIRQ17_Handler;                       /*   9 The PECI Interface allows the EC to retrieve temperature readings from PECI-compliant devices. (PECI) */
  void* pfnGIRQ18_Handler;                       /*  10 The QMSPI may be used to communicate with various peripheral devices that use a Serial Peripheral Interface (QMSPI) */
  void* pfnGIRQ19_Handler;                       /*  11 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  void* pfnGIRQ20_Handler;                       /*  12 OTP Programming registers.\n (OTP) */
  void* pfnGIRQ21_Handler;                       /*  13 The function of the Watchdog Timer is to provide a mechanism to detect if the internal embedded controller has failed. (WDT) */
  void* pfnGIRQ23_Handler;                       /*  14 This 16-bit timer block offers a simple mechanism for firmware to maintain a time base (TIMER16_0) */
  void* pfnGIRQ24_Handler;                       /*  15 The ESPI VW Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC (ESPI_MSVW00_06) */
  void* pfnGIRQ25_Handler;                       /*  16 The ESPI VW Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC (ESPI_MSVW07_10) */
  void* pfnGIRQ26_Handler;                       /*  17 GPIO Pin Control Registers (GPIO) */
  void* pvReserved18;
  void* pvReserved19;
  void* pfnI2CSMB0_Handler;                      /*  20 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB0) */
  void* pfnI2CSMB1_Handler;                      /*  21 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB1) */
  void* pfnI2CSMB2_Handler;                      /*  22 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB2) */
  void* pfnI2CSMB3_Handler;                      /*  23 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB3) */
  void* pfnDMA_CH00_Handler;                     /*  24 DMA Channel 00 Registers (DMA_CHAN00) */
  void* pfnDMA_CH01_Handler;                     /*  25 DMA Channel 01 Registers (DMA_CHAN01) */
  void* pfnDMA_CH02_Handler;                     /*  26 DMA Channel 02 Registers (DMA_CHAN02) */
  void* pfnDMA_CH03_Handler;                     /*  27 DMA Channel 02 Registers (DMA_CHAN03) */
  void* pfnDMA_CH04_Handler;                     /*  28 DMA Channel 02 Registers (DMA_CHAN04) */
  void* pfnDMA_CH05_Handler;                     /*  29 DMA Channel 02 Registers (DMA_CHAN05) */
  void* pfnDMA_CH06_Handler;                     /*  30 DMA Channel 02 Registers (DMA_CHAN06) */
  void* pfnDMA_CH07_Handler;                     /*  31 DMA Channel 02 Registers (DMA_CHAN07) */
  void* pfnDMA_CH08_Handler;                     /*  32 DMA Channel 02 Registers (DMA_CHAN08) */
  void* pfnDMA_CH09_Handler;                     /*  33 DMA Channel 02 Registers (DMA_CHAN09) */
  void* pfnDMA_CH10_Handler;                     /*  34 DMA Channel 02 Registers (DMA_CHAN10) */
  void* pfnDMA_CH11_Handler;                     /*  35 DMA Channel 02 Registers (DMA_CHAN11) */
  void* pvReserved36;
  void* pvReserved37;
  void* pvReserved38;
  void* pvReserved39;
  void* pfnUART0_Handler;                        /*  40 The 16550 UART is a full-function Two Pin Serial Port that supports the standard RS-232 Interface. (UART0) */
  void* pfnUART1_Handler;                        /*  41 The 16550 UART is a full-function Two Pin Serial Port that supports the standard RS-232 Interface. (UART1) */
  void* pfnEMI0_Handler;                         /*  42 The EMI provides a communication between system host and Embedded Controller (EMI0) */
  void* pfnEMI1_Handler;                         /*  43 The EMI provides a communication between system host and Embedded Controller (EMI1) */
  void* pfnUART2_Handler;                        /*  44 The 16550 UART is a full-function Two Pin Serial Port that supports the standard RS-232 Interface. (UART2) */
  void* pfnAEC0_IBF_Handler;                     /*  45 The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC0) */
  void* pfnAEC0_OBE_Handler;                     /*  46 The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC0) */
  void* pfnAEC1_IBF_Handler;                     /*  47 The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC1) */
  void* pfnAEC1_OBE_Handler;                     /*  48 The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC1) */
  void* pfnAEC2_IBF_Handler;                     /*  49 The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC2) */
  void* pfnAEC2_OBE_Handler;                     /*  50 The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC2) */
  void* pfnAEC3_IBF_Handler;                     /*  51 The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC3) */
  void* pfnAEC3_OBE_Handler;                     /*  52 The ACPI-ECI provides a four byte full duplex data interface. (ACPI_EC3) */
  void* pvReserved53;
  void* pvReserved54;
  void* pfnAPM1_CTL_Handler;                     /*  55 These features comply with the ACPI Specification through a combination of hardware and EC software (PM1) */
  void* pfnAPM1_EN_Handler;                      /*  56 These features comply with the ACPI Specification through a combination of hardware and EC software (PM1) */
  void* pfnAPM1_STS_Handler;                     /*  57 These features comply with the ACPI Specification through a combination of hardware and EC software (PM1) */
  void* pfnKBC_OBE_Handler;                      /*  58 The Keyboard Controller is a Host/EC Message Interface with hardware assists to emulate 8042 behavior (KBC) */
  void* pfnKBC_IBF_Handler;                      /*  59 The Keyboard Controller is a Host/EC Message Interface with hardware assists to emulate 8042 behavior (KBC) */
  void* pfnMBOX_Handler;                         /*  60 The Mailbox provides a standard run-time mechanism for the host to communicate with the Embedded Controller (EC). (MBX) */
  void* pvReserved61;
  void* pfnP80CAP0_Handler;                      /*  62 Diagnostic data is written by the Host Interface to the Port 80 BIOS Debug Port (PORT_80_DEBUG0) */
  void* pfnP80CAP1_Handler;                      /*  63 Diagnostic data is written by the Host Interface to the Port 80 BIOS Debug Port (PORT_80_DEBUG1) */
  void* pvReserved64;
  void* pfnPKE_ERR_Handler;                      /*  65 Crypto block interrupt (PKE_ERR) */
  void* pfnPKE_END_Handler;                      /*  66 Crypto block interrupt (PKE_END) */
  void* pfnRNG_Handler;                          /*  67 Crypto block interrupt (RNG) */
  void* pfnAES_Handler;                          /*  68 Crypto block interrupt (AES) */
  void* pfnHASH_Handler;                         /*  69 Crypto block interrupt (HASH) */
  void* pfnPECI_Handler;                         /*  70 The PECI Interface allows the EC to retrieve temperature readings from PECI-compliant devices. (PECI) */
  void* pfnTACH0_Handler;                        /*  71 This block monitors TACH output signals from various types of fans, and determines their speed. (TACH0) */
  void* pfnTACH1_Handler;                        /*  72 This block monitors TACH output signals from various types of fans, and determines their speed. (TACH1) */
  void* pfnTACH2_Handler;                        /*  73 This block monitors TACH output signals from various types of fans, and determines their speed. (TACH2) */
  void* pvReserved74;
  void* pvReserved75;
  void* pvReserved76;
  void* pvReserved77;
  void* pfnADC_SNGL_Handler;                     /*  78 This block is designed to convert external analog voltage readings into digital values. (ADC) */
  void* pfnADC_RPT_Handler;                      /*  79 This block is designed to convert external analog voltage readings into digital values. (ADC) */
  void* pvReserved80;
  void* pvReserved81;
  void* pvReserved82;
  void* pfnLED0_Handler;                         /*  83 The LED is implemented using a PWM that can be driven either by the 48 MHz clock or by a 32.768 KHz clock input. (LED0) */
  void* pfnLED1_Handler;                         /*  84 The LED is implemented using a PWM that can be driven either by the 48 MHz clock or by a 32.768 KHz clock input. (LED1) */
  void* pfnLED2_Handler;                         /*  85 The LED is implemented using a PWM that can be driven either by the 48 MHz clock or by a 32.768 KHz clock input. (LED2) */
  void* pvReserved86;
  void* pfnPHOT_Handler;                         /*  87 This block monitors the PROCHOT# signal generated by the host processor. It is designed to detect single assertions and monitor cumulative PROCHOT active time. (PHOT) */
  void* pvReserved88;
  void* pvReserved89;
  void* pfnSPISLV_Handler;                       /*  90 SPI Slave Register. (SPI_SLAVE) */
  void* pfnQMSPI_Handler;                        /*  91 The QMSPI may be used to communicate with various peripheral devices that use a Serial Peripheral Interface (QMSPI) */
  void* pvReserved92;
  void* pvReserved93;
  void* pvReserved94;
  void* pvReserved95;
  void* pvReserved96;
  void* pvReserved97;
  void* pvReserved98;
  void* pvReserved99;
  void* pfnPS2_0_ACT_Handler;                    /* 100 The four PS/2 Ports implementation eliminates the need to bit bang I/O ports to generate PS/2 traffic (PS2_0) */
  void* pfnPS2_1_ACT_Handler;                    /* 101 The four PS/2 Ports implementation eliminates the need to bit bang I/O ports to generate PS/2 traffic (PS2_1) */
  void* pvReserved102;
  void* pfnINTR_PC_Handler;                      /* 103 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  void* pfnINTR_BM1_Handler;                     /* 104 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  void* pfnINTR_BM2_Handler;                     /* 105 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  void* pfnINTR_LTR_Handler;                     /* 106 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  void* pfnINTR_OOB_UP_Handler;                  /* 107 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  void* pfnINTR_OOB_DOWN_Handler;                /* 108 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  void* pfnINTR_FLASH_Handler;                   /* 109 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  void* pfnESPI_RESET_Handler;                   /* 110 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  void* pfnTMR_Handler;                          /* 111 RTOS is a 32-bit timer designed to operate on the 32kHz oscillator which is available during all chip sleep states. (RTOS) */
  void* pfnHTMR0_Handler;                        /* 112 The Hibernation Timer can generate a wake event to the Embedded Controller (EC) when it is in a hibernation mode (HTM0) */
  void* pfnHTMR1_Handler;                        /* 113 The Hibernation Timer can generate a wake event to the Embedded Controller (EC) when it is in a hibernation mode (HTM1) */
  void* pfnWK_Handler;                           /* 114 The Week Timer and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state (WEEK) */
  void* pfnWKSUB_Handler;                        /* 115 The Week Timer and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state (WEEK) */
  void* pfnWKSEC_Handler;                        /* 116 The Week Timer and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state (WEEK) */
  void* pfnWKSUBSEC_Handler;                     /* 117 The Week Timer and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state (WEEK) */
  void* pfnSYSPWR_Handler;                       /* 118 The Week Timer and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state (WEEK) */
  void* pfnRTC_Handler;                          /* 119 This is the set of registers that are automatically counted by hardware every 1 second while the block is enabled (RTC) */
  void* pfnRTC_ALARM_Handler;                    /* 120 This is the set of registers that are automatically counted by hardware every 1 second while the block is enabled (RTC) */
  void* pfnVCI_OVRD_IN_Handler;                  /* 121 The VBAT-Powered Control Interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. (VCI) */
  void* pfnVCI_IN0_Handler;                      /* 122 The VBAT-Powered Control Interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. (VCI) */
  void* pfnVCI_IN1_Handler;                      /* 123 The VBAT-Powered Control Interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. (VCI) */
  void* pfnVCI_IN2_Handler;                      /* 124 The VBAT-Powered Control Interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. (VCI) */
  void* pfnVCI_IN3_Handler;                      /* 125 The VBAT-Powered Control Interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. (VCI) */
  void* pvReserved126;
  void* pvReserved127;
  void* pvReserved128;
  void* pfnPS2_0A_WAKE_Handler;                  /* 129 The four PS/2 Ports implementation eliminates the need to bit bang I/O ports to generate PS/2 traffic (PS2_0) */
  void* pfnPS2_0B_WAKE_Handler;                  /* 130 The four PS/2 Ports implementation eliminates the need to bit bang I/O ports to generate PS/2 traffic (PS2_0) */
  void* pvReserved131;
  void* pfnPS2_1B_WAKE_Handler;                  /* 132 The four PS/2 Ports implementation eliminates the need to bit bang I/O ports to generate PS/2 traffic (PS2_1) */
  void* pvReserved133;
  void* pvReserved134;
  void* pfnKEYSCAN_Handler;                      /* 135 The Keyboard Scan Interface block provides a register interface to directly scan an external keyboard matrix of size up to 18x8. (KMS) */
  void* pfnTIMER16_0_Handler;                    /* 136 This 16-bit timer block offers a simple mechanism for firmware to maintain a time base (TIMER16_0) */
  void* pfnTIMER16_1_Handler;                    /* 137 This 16-bit timer block offers a simple mechanism for firmware to maintain a time base (TIMER16_1) */
  void* pvReserved138;
  void* pvReserved139;
  void* pfnTIMER32_0_Handler;                    /* 140 This 32-bit timer block offers a simple mechanism for firmware to maintain a time base (TIMER32_0) */
  void* pfnTIMER32_1_Handler;                    /* 141 This 32-bit timer block offers a simple mechanism for firmware to maintain a time base (TIMER32_1) */
  void* pvReserved142;
  void* pvReserved143;
  void* pvReserved144;
  void* pvReserved145;
  void* pfnCCT_Handler;                          /* 146 This is a 16-bit auto-reloading timer/counter. (CCT) */
  void* pfnCCT_CAP0_Handler;                     /* 147 This is a 16-bit auto-reloading timer/counter. (CCT) */
  void* pfnCCT_CAP1_Handler;                     /* 148 This is a 16-bit auto-reloading timer/counter. (CCT) */
  void* pfnCCT_CAP2_Handler;                     /* 149 This is a 16-bit auto-reloading timer/counter. (CCT) */
  void* pfnCCT_CAP3_Handler;                     /* 150 This is a 16-bit auto-reloading timer/counter. (CCT) */
  void* pfnCCT_CAP4_Handler;                     /* 151 This is a 16-bit auto-reloading timer/counter. (CCT) */
  void* pfnCCT_CAP5_Handler;                     /* 152 This is a 16-bit auto-reloading timer/counter. (CCT) */
  void* pfnCCT_CMP0_Handler;                     /* 153 This is a 16-bit auto-reloading timer/counter. (CCT) */
  void* pfnCCT_CMP1_Handler;                     /* 154 This is a 16-bit auto-reloading timer/counter. (CCT) */
  void* pvReserved155;
  void* pfnESPI_VWIRE_Handler;                   /* 156 The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design (ESPI_IO) */
  void* pvReserved157;
  void* pfnI2CSMB4_Handler;                      /* 158 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. (SMB4) */
  void* pfnTACH3_Handler;                        /* 159 This block monitors TACH output signals from various types of fans, and determines their speed. (TACH3) */
  void* pfnCEC_Handler;                          /* 160 The HDMI-CEC provides high-level control functions between all the various audiovisual products in a users environment. (HDMI_CEC) */
  void* pfnSGPIO0_Handler;                       /* 161 This is Serial General Purpous Input Output block (SGPIO0) */
  void* pfnSGPIO1_Handler;                       /* 162 This is Serial General Purpous Input Output block (SGPIO1) */
  void* pfnSGPIO2_Handler;                       /* 163 This is Serial General Purpous Input Output block (SGPIO2) */
  void* pfnSGPIO3_Handler;                       /* 164 This is Serial General Purpous Input Output block (SGPIO3) */
  void* pvReserved165;
  void* pfnSAF_DONE_Handler;                     /* 166 SAF BRIDGE COMPONENT (SAFBC) */
  void* pfnSAF_ERR_Handler;                      /* 167 SAF BRIDGE COMPONENT (SAFBC) */
  void* pfnI2C0_Handler;                         /* 168 The I2C interface can handle standard I2C interface. (I2C0) */
  void* pfnI2C1_Handler;                         /* 169 The I2C interface can handle standard I2C interface. (I2C1) */
  void* pfnI2C2_Handler;                         /* 170 The I2C interface can handle standard I2C interface. (I2C2) */
  void* pfnWDT_Handler;                          /* 171 The function of the Watchdog Timer is to provide a mechanism to detect if the internal embedded controller has failed. (WDT) */
} DeviceVectors;

