MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CX0525SG12144/mcu.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M4 exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void BusFault_Handler              ( void );
void UsageFault_Handler            ( void );
void SVCall_Handler                ( void );
void DebugMonitor_Handler          ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void GIRQ08_Handler                ( void );
void GIRQ09_Handler                ( void );
void GIRQ10_Handler                ( void );
void GIRQ11_Handler                ( void );
void GIRQ12_Handler                ( void );
void GIRQ13_Handler                ( void );
void GIRQ14_Handler                ( void );
void GIRQ15_Handler                ( void );
void GIRQ16_Handler                ( void );
void GIRQ17_Handler                ( void );
void GIRQ18_Handler                ( void );
void GIRQ19_Handler                ( void );
void GIRQ20_Handler                ( void );
void GIRQ21_Handler                ( void );
void GIRQ23_Handler                ( void );
void GIRQ24_Handler                ( void );
void GIRQ25_Handler                ( void );
void GIRQ26_Handler                ( void );
void I2CSMB0_Handler               ( void );
void I2CSMB1_Handler               ( void );
void I2CSMB2_Handler               ( void );
void I2CSMB3_Handler               ( void );
void DMA_CH00_Handler              ( void );
void DMA_CH01_Handler              ( void );
void DMA_CH02_Handler              ( void );
void DMA_CH03_Handler              ( void );
void DMA_CH04_Handler              ( void );
void DMA_CH05_Handler              ( void );
void DMA_CH06_Handler              ( void );
void DMA_CH07_Handler              ( void );
void DMA_CH08_Handler              ( void );
void DMA_CH09_Handler              ( void );
void DMA_CH10_Handler              ( void );
void DMA_CH11_Handler              ( void );
void UART0_Handler                 ( void );
void UART1_Handler                 ( void );
void EMI0_Handler                  ( void );
void EMI1_Handler                  ( void );
void UART2_Handler                 ( void );
void AEC0_IBF_Handler              ( void );
void AEC0_OBE_Handler              ( void );
void AEC1_IBF_Handler              ( void );
void AEC1_OBE_Handler              ( void );
void AEC2_IBF_Handler              ( void );
void AEC2_OBE_Handler              ( void );
void AEC3_IBF_Handler              ( void );
void AEC3_OBE_Handler              ( void );
void APM1_CTL_Handler              ( void );
void APM1_EN_Handler               ( void );
void APM1_STS_Handler              ( void );
void KBC_OBE_Handler               ( void );
void KBC_IBF_Handler               ( void );
void MBOX_Handler                  ( void );
void P80CAP0_Handler               ( void );
void P80CAP1_Handler               ( void );
void PKE_ERR_Handler               ( void );
void PKE_END_Handler               ( void );
void RNG_Handler                   ( void );
void AES_Handler                   ( void );
void HASH_Handler                  ( void );
void PECI_Handler                  ( void );
void TACH0_Handler                 ( void );
void TACH1_Handler                 ( void );
void TACH2_Handler                 ( void );
void ADC_SNGL_Handler              ( void );
void ADC_RPT_Handler               ( void );
void LED0_Handler                  ( void );
void LED1_Handler                  ( void );
void LED2_Handler                  ( void );
void PHOT_Handler                  ( void );
void SPISLV_Handler                ( void );
void QMSPI_Handler                 ( void );
void PS2_0_ACT_Handler             ( void );
void PS2_1_ACT_Handler             ( void );
void INTR_PC_Handler               ( void );
void INTR_BM1_Handler              ( void );
void INTR_BM2_Handler              ( void );
void INTR_LTR_Handler              ( void );
void INTR_OOB_UP_Handler           ( void );
void INTR_OOB_DOWN_Handler         ( void );
void INTR_FLASH_Handler            ( void );
void ESPI_RESET_Handler            ( void );
void TMR_Handler                   ( void );
void HTMR0_Handler                 ( void );
void HTMR1_Handler                 ( void );
void WK_Handler                    ( void );
void WKSUB_Handler                 ( void );
void WKSEC_Handler                 ( void );
void WKSUBSEC_Handler              ( void );
void SYSPWR_Handler                ( void );
void RTC_Handler                   ( void );
void RTC_ALARM_Handler             ( void );
void VCI_OVRD_IN_Handler           ( void );
void VCI_IN0_Handler               ( void );
void VCI_IN1_Handler               ( void );
void VCI_IN2_Handler               ( void );
void VCI_IN3_Handler               ( void );
void PS2_0A_WAKE_Handler           ( void );
void PS2_0B_WAKE_Handler           ( void );
void PS2_1B_WAKE_Handler           ( void );
void KEYSCAN_Handler               ( void );
void TIMER16_0_Handler             ( void );
void TIMER16_1_Handler             ( void );
void TIMER32_0_Handler             ( void );
void TIMER32_1_Handler             ( void );
void CCT_Handler                   ( void );
void CCT_CAP0_Handler              ( void );
void CCT_CAP1_Handler              ( void );
void CCT_CAP2_Handler              ( void );
void CCT_CAP3_Handler              ( void );
void CCT_CAP4_Handler              ( void );
void CCT_CAP5_Handler              ( void );
void CCT_CMP0_Handler              ( void );
void CCT_CMP1_Handler              ( void );
void ESPI_VWIRE_Handler            ( void );
void I2CSMB4_Handler               ( void );
void TACH3_Handler                 ( void );
void CEC_Handler                   ( void );
void SGPIO0_Handler                ( void );
void SGPIO1_Handler                ( void );
void SGPIO2_Handler                ( void );
void SGPIO3_Handler                ( void );
void SAF_DONE_Handler              ( void );
void SAF_ERR_Handler               ( void );
void I2C0_Handler                  ( void );
void I2C1_Handler                  ( void );
void I2C2_Handler                  ( void );
void WDT_Handler                   ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M4 Processor and Core Peripherals */
#define __SOFTFP__ // Note: Added for MikroE implementation.
#define __FPU_PRESENT                      0 /* FPU present or not                                                        */
#define __MPU_PRESENT                      0 /* MPU present or not                                                        */
#define __CM4_REV                     0x0100 /* CM4 Core Revision                                                         */
#define __NVIC_PRIO_BITS                   3 /* Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig             0 /* Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                     1 /* Vector Table Offset Regisrer present or not                               */
#define __ARCH_ARM                         1
#define __ARCH_ARM_CORTEX_M                1

