MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CX0525SG12144/mcu.h
/* CMSIS includes */
#include "core_cm4.h"
#if defined USE_CMSIS_INIT
// Note: Changed for MikroE implementation.
//#include "system_0525sg12.h"
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*   SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CX0525SG12144                */
/* ************************************************************************** */
#include "component/acpi_ec.h"
#include "component/adc.h"
#include "component/cct.h"
#include "component/dma_chan00.h"
#include "component/dma_chan01.h"
#include "component/dma_chan02.h"
#include "component/dma_main.h"
#include "component/ecia.h"
#include "component/ec_reg_bank.h"
#include "component/emi.h"
#include "component/espi_io.h"
#include "component/espi_memory.h"
#include "component/espi_msvw00_06.h"
#include "component/espi_msvw07_1.h"
#include "component/espi_scratch.h"
#include "component/espi_smvw00_1.h"
#include "component/gcr.h"
#include "component/gpio.h"
#include "component/hdmi_cec.h"
#include "component/htm.h"
#include "component/i2c.h"
#include "component/kbc.h"
#include "component/kms.h"
#include "component/led.h"
#include "component/mbx.h"
#include "component/otp.h"
#include "component/pcr.h"
#include "component/peci.h"
#include "component/phot.h"
#include "component/pm1.h"
#include "component/port92.h"
#include "component/port_80_debug.h"
#include "component/ps2.h"
#include "component/pwm.h"
#include "component/qmspi.h"
#include "component/rtc.h"
#include "component/rtos.h"
#include "component/safbc.h"
#include "component/safcomm.h"
#include "component/sgpio.h"
#include "component/smb.h"
#include "component/spi_slave.h"
#include "component/tach.h"
#include "component/tfdp.h"
#include "component/timer16.h"
#include "component/timer32.h"
#include "component/uart.h"
#include "component/vbat.h"
#include "component/vbat_ram.h"
#include "component/vci.h"
#include "component/wdt.h"
#include "component/week.h"

/* ************************************************************************** */
/*   INSTANCE DEFINITIONS FOR PIC32CX0525SG12144 */
/* ************************************************************************** */
#include "instance/acpi_ec0.h"
#include "instance/acpi_ec1.h"
#include "instance/acpi_ec2.h"
#include "instance/acpi_ec3.h"
#include "instance/adc.h"
#include "instance/cct.h"
#include "instance/dma_chan00.h"
#include "instance/dma_chan01.h"
#include "instance/dma_chan02.h"
#include "instance/dma_chan03.h"
#include "instance/dma_chan04.h"
#include "instance/dma_chan05.h"
#include "instance/dma_chan06.h"
#include "instance/dma_chan07.h"
#include "instance/dma_chan08.h"
#include "instance/dma_chan09.h"
#include "instance/dma_chan10.h"
#include "instance/dma_chan11.h"
#include "instance/dma_main.h"
#include "instance/ecia.h"
#include "instance/ec_reg_bank.h"
#include "instance/emi0.h"
#include "instance/emi1.h"
#include "instance/espi_io.h"
#include "instance/espi_memory.h"
#include "instance/espi_msvw00_06.h"
#include "instance/espi_msvw07_10.h"
#include "instance/espi_scratch.h"
#include "instance/espi_smvw00_10.h"
#include "instance/gcr.h"
#include "instance/gpio.h"
#include "instance/hdmi_cec.h"
#include "instance/htm0.h"
#include "instance/htm1.h"
#include "instance/i2c0.h"
#include "instance/i2c1.h"
#include "instance/i2c2.h"
#include "instance/kbc.h"
#include "instance/kms.h"
#include "instance/led0.h"
#include "instance/led1.h"
#include "instance/led2.h"
#include "instance/mbx.h"
#include "instance/otp.h"
#include "instance/pcr.h"
#include "instance/peci.h"
#include "instance/phot.h"
#include "instance/pm1.h"
#include "instance/port92.h"
#include "instance/port_80_debug0.h"
#include "instance/port_80_debug1.h"
#include "instance/ps2_0.h"
#include "instance/ps2_1.h"
#include "instance/pwm0.h"
#include "instance/pwm1.h"
#include "instance/pwm2.h"
#include "instance/pwm3.h"
#include "instance/pwm4.h"
#include "instance/pwm5.h"
#include "instance/pwm6.h"
#include "instance/pwm7.h"
#include "instance/pwm8.h"
#include "instance/qmspi.h"
#include "instance/rtc.h"
#include "instance/rtos.h"
#include "instance/safbc.h"
#include "instance/safcomm.h"
#include "instance/sgpio0.h"
#include "instance/sgpio1.h"
#include "instance/sgpio2.h"
#include "instance/sgpio3.h"
#include "instance/smb0.h"
#include "instance/smb1.h"
#include "instance/smb2.h"
#include "instance/smb3.h"
#include "instance/smb4.h"
#include "instance/spi_slave.h"
#include "instance/tach0.h"
#include "instance/tach1.h"
#include "instance/tach2.h"
#include "instance/tach3.h"
#include "instance/tfdp.h"
#include "instance/timer16_0.h"
#include "instance/timer16_1.h"
#include "instance/timer32_0.h"
#include "instance/timer32_1.h"
#include "instance/uart0.h"
#include "instance/uart1.h"
#include "instance/uart2.h"
#include "instance/vbat.h"
#include "instance/vbat_ram.h"
#include "instance/vci.h"
#include "instance/wdt.h"
#include "instance/week.h"

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CX0525SG12144                          */
/* ************************************************************************** */

#define ID_PERIPH_MAX    (  0) /* Number of peripheral IDs */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CX0525SG12144            */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define PCR_REGS                         ((pcr_registers_t*)0x40080100)                /* PCR Registers Address        */
#define DMA_MAIN_REGS                    ((dma_main_registers_t*)0x40002400)           /* DMA_MAIN Registers Address   */
#define DMA_CHAN00_REGS                  ((dma_chan00_registers_t*)0x40002440)         /* DMA_CHAN00 Registers Address */
#define DMA_CHAN01_REGS                  ((dma_chan01_registers_t*)0x40002480)         /* DMA_CHAN01 Registers Address */
#define DMA_CHAN02_REGS                  ((dma_chan02_registers_t*)0x400024c0)         /* DMA_CHAN02 Registers Address */
#define DMA_CHAN03_REGS                  ((dma_chan02_registers_t*)0x40002500)         /* DMA_CHAN03 Registers Address */
#define DMA_CHAN04_REGS                  ((dma_chan02_registers_t*)0x40002540)         /* DMA_CHAN04 Registers Address */
#define DMA_CHAN05_REGS                  ((dma_chan02_registers_t*)0x40002580)         /* DMA_CHAN05 Registers Address */
#define DMA_CHAN06_REGS                  ((dma_chan02_registers_t*)0x400025c0)         /* DMA_CHAN06 Registers Address */
#define DMA_CHAN07_REGS                  ((dma_chan02_registers_t*)0x40002600)         /* DMA_CHAN07 Registers Address */
#define DMA_CHAN08_REGS                  ((dma_chan02_registers_t*)0x40002640)         /* DMA_CHAN08 Registers Address */
#define DMA_CHAN09_REGS                  ((dma_chan02_registers_t*)0x40002680)         /* DMA_CHAN09 Registers Address */
#define DMA_CHAN10_REGS                  ((dma_chan02_registers_t*)0x400026c0)         /* DMA_CHAN10 Registers Address */
#define DMA_CHAN11_REGS                  ((dma_chan02_registers_t*)0x40002700)         /* DMA_CHAN11 Registers Address */
#define ECIA_REGS                        ((ecia_registers_t*)0x4000e000)               /* ECIA Registers Address       */
#define ESPI_IO_REGS                     ((espi_io_registers_t*)0x400f3400)            /* ESPI_IO Registers Address    */
#define ESPI_MEMORY_REGS                 ((espi_memory_registers_t*)0x400f3800)        /* ESPI_MEMORY Registers Address */
#define ESPI_MSVW00_06_REGS              ((espi_msvw00_06_registers_t*)0x400f9c00)     /* ESPI_MSVW00_06 Registers Address */
#define ESPI_MSVW07_10_REGS              ((espi_msvw07_1_registers_t*)0x400f9c54)      /* ESPI_MSVW07_10 Registers Address */
#define ESPI_SMVW00_10_REGS              ((espi_smvw00_1_registers_t*)0x400f9e00)      /* ESPI_SMVW00_10 Registers Address */
#define GCR_REGS                         ((gcr_registers_t*)0x400fff00)                /* GCR Registers Address        */
#define KBC_REGS                         ((kbc_registers_t*)0x400f0400)                /* KBC Registers Address        */
#define PORT92_REGS                      ((port92_registers_t*)0x400f2000)             /* PORT92 Registers Address     */
#define ACPI_EC0_REGS                    ((acpi_ec_registers_t*)0x400f0800)            /* ACPI_EC0 Registers Address   */
#define ACPI_EC1_REGS                    ((acpi_ec_registers_t*)0x400f0c00)            /* ACPI_EC1 Registers Address   */
#define ACPI_EC2_REGS                    ((acpi_ec_registers_t*)0x400f1000)            /* ACPI_EC2 Registers Address   */
#define ACPI_EC3_REGS                    ((acpi_ec_registers_t*)0x400f1400)            /* ACPI_EC3 Registers Address   */
#define PM1_REGS                         ((pm1_registers_t*)0x400f1c00)                /* PM1 Registers Address        */
#define EMI0_REGS                        ((emi_registers_t*)0x400f4000)                /* EMI0 Registers Address       */
#define EMI1_REGS                        ((emi_registers_t*)0x400f4400)                /* EMI1 Registers Address       */
#define MBX_REGS                         ((mbx_registers_t*)0x400f0000)                /* MBX Registers Address        */
#define UART0_REGS                       ((uart_registers_t*)0x400f2400)               /* UART0 Registers Address      */
#define UART1_REGS                       ((uart_registers_t*)0x400f2800)               /* UART1 Registers Address      */
#define UART2_REGS                       ((uart_registers_t*)0x400f2c00)               /* UART2 Registers Address      */
#define GPIO_REGS                        ((gpio_registers_t*)0x40081000)               /* GPIO Registers Address       */
#define WDT_REGS                         ((wdt_registers_t*)0x40000400)                /* WDT Registers Address        */
#define TIMER16_0_REGS                   ((timer16_registers_t*)0x40000c00)            /* TIMER16_0 Registers Address  */
#define TIMER16_1_REGS                   ((timer16_registers_t*)0x40000c20)            /* TIMER16_1 Registers Address  */
#define TIMER32_0_REGS                   ((timer32_registers_t*)0x40000c80)            /* TIMER32_0 Registers Address  */
#define TIMER32_1_REGS                   ((timer32_registers_t*)0x40000ca0)            /* TIMER32_1 Registers Address  */
#define CCT_REGS                         ((cct_registers_t*)0x40001000)                /* CCT Registers Address        */
#define HTM0_REGS                        ((htm_registers_t*)0x40009800)                /* HTM0 Registers Address       */
#define HTM1_REGS                        ((htm_registers_t*)0x40009820)                /* HTM1 Registers Address       */
#define RTOS_REGS                        ((rtos_registers_t*)0x40007400)               /* RTOS Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x400f5000)                /* RTC Registers Address        */
#define WEEK_REGS                        ((week_registers_t*)0x4000ac80)               /* WEEK Registers Address       */
#define TACH0_REGS                       ((tach_registers_t*)0x40006000)               /* TACH0 Registers Address      */
#define TACH1_REGS                       ((tach_registers_t*)0x40006010)               /* TACH1 Registers Address      */
#define TACH2_REGS                       ((tach_registers_t*)0x40006020)               /* TACH2 Registers Address      */
#define TACH3_REGS                       ((tach_registers_t*)0x40006030)               /* TACH3 Registers Address      */
#define PWM0_REGS                        ((pwm_registers_t*)0x40005800)                /* PWM0 Registers Address       */
#define PWM1_REGS                        ((pwm_registers_t*)0x40005810)                /* PWM1 Registers Address       */
#define PWM2_REGS                        ((pwm_registers_t*)0x40005820)                /* PWM2 Registers Address       */
#define PWM3_REGS                        ((pwm_registers_t*)0x40005830)                /* PWM3 Registers Address       */
#define PWM4_REGS                        ((pwm_registers_t*)0x40005840)                /* PWM4 Registers Address       */
#define PWM5_REGS                        ((pwm_registers_t*)0x40005850)                /* PWM5 Registers Address       */
#define PWM6_REGS                        ((pwm_registers_t*)0x40005860)                /* PWM6 Registers Address       */
#define PWM7_REGS                        ((pwm_registers_t*)0x40005870)                /* PWM7 Registers Address       */
#define PWM8_REGS                        ((pwm_registers_t*)0x40005880)                /* PWM8 Registers Address       */
#define PECI_REGS                        ((peci_registers_t*)0x40006400)               /* PECI Registers Address       */
#define ADC_REGS                         ((adc_registers_t*)0x40007c00)                /* ADC Registers Address        */
#define PHOT_REGS                        ((phot_registers_t*)0x40003400)               /* PHOT Registers Address       */
#define LED0_REGS                        ((led_registers_t*)0x4000b800)                /* LED0 Registers Address       */
#define LED1_REGS                        ((led_registers_t*)0x4000b900)                /* LED1 Registers Address       */
#define LED2_REGS                        ((led_registers_t*)0x4000ba00)                /* LED2 Registers Address       */
#define KMS_REGS                         ((kms_registers_t*)0x40009c00)                /* KMS Registers Address        */
#define SMB0_REGS                        ((smb_registers_t*)0x40004000)                /* SMB0 Registers Address       */
#define SMB1_REGS                        ((smb_registers_t*)0x40004400)                /* SMB1 Registers Address       */
#define SMB2_REGS                        ((smb_registers_t*)0x40004800)                /* SMB2 Registers Address       */
#define SMB3_REGS                        ((smb_registers_t*)0x40004c00)                /* SMB3 Registers Address       */
#define SMB4_REGS                        ((smb_registers_t*)0x40005000)                /* SMB4 Registers Address       */
#define I2C0_REGS                        ((i2c_registers_t*)0x40005100)                /* I2C0 Registers Address       */
#define I2C1_REGS                        ((i2c_registers_t*)0x40005200)                /* I2C1 Registers Address       */
#define I2C2_REGS                        ((i2c_registers_t*)0x40005300)                /* I2C2 Registers Address       */
#define QMSPI_REGS                       ((qmspi_registers_t*)0x40070000)              /* QMSPI Registers Address      */
#define PS2_0_REGS                       ((ps2_registers_t*)0x40009000)                /* PS2_0 Registers Address      */
#define PS2_1_REGS                       ((ps2_registers_t*)0x40009040)                /* PS2_1 Registers Address      */
#define TFDP_REGS                        ((tfdp_registers_t*)0x40008c00)               /* TFDP Registers Address       */
#define PORT_80_DEBUG0_REGS              ((port_80_debug_registers_t*)0x400f8000)      /* PORT_80_DEBUG0 Registers Address */
#define PORT_80_DEBUG1_REGS              ((port_80_debug_registers_t*)0x400f8400)      /* PORT_80_DEBUG1 Registers Address */
#define VCI_REGS                         ((vci_registers_t*)0x4000ae00)                /* VCI Registers Address        */
#define VBAT_RAM_REGS                    ((vbat_ram_registers_t*)0x4000a800)           /* VBAT_RAM Registers Address   */
#define VBAT_REGS                        ((vbat_registers_t*)0x4000a400)               /* VBAT Registers Address       */
#define EC_REG_BANK_REGS                 ((ec_reg_bank_registers_t*)0x4000fc00)        /* EC_REG_BANK Registers Address */
#define ESPI_SCRATCH_REGS                ((espi_scratch_registers_t*)0x400fbc00)       /* ESPI_SCRATCH Registers Address */
#define HDMI_CEC_REGS                    ((hdmi_cec_registers_t*)0x40006800)           /* HDMI_CEC Registers Address   */
#define SAFBC_REGS                       ((safbc_registers_t*)0x40008000)              /* SAFBC Registers Address      */
#define SAFCOMM_REGS                     ((safcomm_registers_t*)0x40071000)            /* SAFCOMM Registers Address    */
#define SGPIO0_REGS                      ((sgpio_registers_t*)0x4000a000)              /* SGPIO0 Registers Address     */
#define SGPIO1_REGS                      ((sgpio_registers_t*)0x4000a100)              /* SGPIO1 Registers Address     */
#define SGPIO2_REGS                      ((sgpio_registers_t*)0x4000a200)              /* SGPIO2 Registers Address     */
#define SGPIO3_REGS                      ((sgpio_registers_t*)0x4000a300)              /* SGPIO3 Registers Address     */
#define OTP_REGS                         ((otp_registers_t*)0x40082000)                /* OTP Registers Address        */
#define SPI_SLAVE_REGS                   ((spi_slave_registers_t*)0x40007000)          /* SPI_SLAVE Registers Address  */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

