MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CX0525SG12144/mcu.h
/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CX0525SG12144                          */
/* ************************************************************************** */
#define PCR_BASE_ADDRESS                 _UINT32_(0x40080100)                          /* PCR Base Address */
#define DMA_MAIN_BASE_ADDRESS            _UINT32_(0x40002400)                          /* DMA_MAIN Base Address */
#define DMA_CHAN00_BASE_ADDRESS          _UINT32_(0x40002440)                          /* DMA_CHAN00 Base Address */
#define DMA_CHAN01_BASE_ADDRESS          _UINT32_(0x40002480)                          /* DMA_CHAN01 Base Address */
#define DMA_CHAN02_BASE_ADDRESS          _UINT32_(0x400024c0)                          /* DMA_CHAN02 Base Address */
#define DMA_CHAN03_BASE_ADDRESS          _UINT32_(0x40002500)                          /* DMA_CHAN03 Base Address */
#define DMA_CHAN04_BASE_ADDRESS          _UINT32_(0x40002540)                          /* DMA_CHAN04 Base Address */
#define DMA_CHAN05_BASE_ADDRESS          _UINT32_(0x40002580)                          /* DMA_CHAN05 Base Address */
#define DMA_CHAN06_BASE_ADDRESS          _UINT32_(0x400025c0)                          /* DMA_CHAN06 Base Address */
#define DMA_CHAN07_BASE_ADDRESS          _UINT32_(0x40002600)                          /* DMA_CHAN07 Base Address */
#define DMA_CHAN08_BASE_ADDRESS          _UINT32_(0x40002640)                          /* DMA_CHAN08 Base Address */
#define DMA_CHAN09_BASE_ADDRESS          _UINT32_(0x40002680)                          /* DMA_CHAN09 Base Address */
#define DMA_CHAN10_BASE_ADDRESS          _UINT32_(0x400026c0)                          /* DMA_CHAN10 Base Address */
#define DMA_CHAN11_BASE_ADDRESS          _UINT32_(0x40002700)                          /* DMA_CHAN11 Base Address */
#define ECIA_BASE_ADDRESS                _UINT32_(0x4000e000)                          /* ECIA Base Address */
#define ESPI_IO_BASE_ADDRESS             _UINT32_(0x400f3400)                          /* ESPI_IO Base Address */
#define ESPI_MEMORY_BASE_ADDRESS         _UINT32_(0x400f3800)                          /* ESPI_MEMORY Base Address */
#define ESPI_MSVW00_06_BASE_ADDRESS      _UINT32_(0x400f9c00)                          /* ESPI_MSVW00_06 Base Address */
#define ESPI_MSVW07_10_BASE_ADDRESS      _UINT32_(0x400f9c54)                          /* ESPI_MSVW07_10 Base Address */
#define ESPI_SMVW00_10_BASE_ADDRESS      _UINT32_(0x400f9e00)                          /* ESPI_SMVW00_10 Base Address */
#define GCR_BASE_ADDRESS                 _UINT32_(0x400fff00)                          /* GCR Base Address */
#define KBC_BASE_ADDRESS                 _UINT32_(0x400f0400)                          /* KBC Base Address */
#define PORT92_BASE_ADDRESS              _UINT32_(0x400f2000)                          /* PORT92 Base Address */
#define ACPI_EC0_BASE_ADDRESS            _UINT32_(0x400f0800)                          /* ACPI_EC0 Base Address */
#define ACPI_EC1_BASE_ADDRESS            _UINT32_(0x400f0c00)                          /* ACPI_EC1 Base Address */
#define ACPI_EC2_BASE_ADDRESS            _UINT32_(0x400f1000)                          /* ACPI_EC2 Base Address */
#define ACPI_EC3_BASE_ADDRESS            _UINT32_(0x400f1400)                          /* ACPI_EC3 Base Address */
#define PM1_BASE_ADDRESS                 _UINT32_(0x400f1c00)                          /* PM1 Base Address */
#define EMI0_BASE_ADDRESS                _UINT32_(0x400f4000)                          /* EMI0 Base Address */
#define EMI1_BASE_ADDRESS                _UINT32_(0x400f4400)                          /* EMI1 Base Address */
#define MBX_BASE_ADDRESS                 _UINT32_(0x400f0000)                          /* MBX Base Address */
#define UART0_BASE_ADDRESS               _UINT32_(0x400f2400)                          /* UART0 Base Address */
#define UART1_BASE_ADDRESS               _UINT32_(0x400f2800)                          /* UART1 Base Address */
#define UART2_BASE_ADDRESS               _UINT32_(0x400f2c00)                          /* UART2 Base Address */
#define GPIO_BASE_ADDRESS                _UINT32_(0x40081000)                          /* GPIO Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x40000400)                          /* WDT Base Address */
#define TIMER16_0_BASE_ADDRESS           _UINT32_(0x40000c00)                          /* TIMER16_0 Base Address */
#define TIMER16_1_BASE_ADDRESS           _UINT32_(0x40000c20)                          /* TIMER16_1 Base Address */
#define TIMER32_0_BASE_ADDRESS           _UINT32_(0x40000c80)                          /* TIMER32_0 Base Address */
#define TIMER32_1_BASE_ADDRESS           _UINT32_(0x40000ca0)                          /* TIMER32_1 Base Address */
#define CCT_BASE_ADDRESS                 _UINT32_(0x40001000)                          /* CCT Base Address */
#define HTM0_BASE_ADDRESS                _UINT32_(0x40009800)                          /* HTM0 Base Address */
#define HTM1_BASE_ADDRESS                _UINT32_(0x40009820)                          /* HTM1 Base Address */
#define RTOS_BASE_ADDRESS                _UINT32_(0x40007400)                          /* RTOS Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x400f5000)                          /* RTC Base Address */
#define WEEK_BASE_ADDRESS                _UINT32_(0x4000ac80)                          /* WEEK Base Address */
#define TACH0_BASE_ADDRESS               _UINT32_(0x40006000)                          /* TACH0 Base Address */
#define TACH1_BASE_ADDRESS               _UINT32_(0x40006010)                          /* TACH1 Base Address */
#define TACH2_BASE_ADDRESS               _UINT32_(0x40006020)                          /* TACH2 Base Address */
#define TACH3_BASE_ADDRESS               _UINT32_(0x40006030)                          /* TACH3 Base Address */
#define PWM0_BASE_ADDRESS                _UINT32_(0x40005800)                          /* PWM0 Base Address */
#define PWM1_BASE_ADDRESS                _UINT32_(0x40005810)                          /* PWM1 Base Address */
#define PWM2_BASE_ADDRESS                _UINT32_(0x40005820)                          /* PWM2 Base Address */
#define PWM3_BASE_ADDRESS                _UINT32_(0x40005830)                          /* PWM3 Base Address */
#define PWM4_BASE_ADDRESS                _UINT32_(0x40005840)                          /* PWM4 Base Address */
#define PWM5_BASE_ADDRESS                _UINT32_(0x40005850)                          /* PWM5 Base Address */
#define PWM6_BASE_ADDRESS                _UINT32_(0x40005860)                          /* PWM6 Base Address */
#define PWM7_BASE_ADDRESS                _UINT32_(0x40005870)                          /* PWM7 Base Address */
#define PWM8_BASE_ADDRESS                _UINT32_(0x40005880)                          /* PWM8 Base Address */
#define PECI_BASE_ADDRESS                _UINT32_(0x40006400)                          /* PECI Base Address */
#define ADC_BASE_ADDRESS                 _UINT32_(0x40007c00)                          /* ADC Base Address */
#define PHOT_BASE_ADDRESS                _UINT32_(0x40003400)                          /* PHOT Base Address */
#define LED0_BASE_ADDRESS                _UINT32_(0x4000b800)                          /* LED0 Base Address */
#define LED1_BASE_ADDRESS                _UINT32_(0x4000b900)                          /* LED1 Base Address */
#define LED2_BASE_ADDRESS                _UINT32_(0x4000ba00)                          /* LED2 Base Address */
#define KMS_BASE_ADDRESS                 _UINT32_(0x40009c00)                          /* KMS Base Address */
#define SMB0_BASE_ADDRESS                _UINT32_(0x40004000)                          /* SMB0 Base Address */
#define SMB1_BASE_ADDRESS                _UINT32_(0x40004400)                          /* SMB1 Base Address */
#define SMB2_BASE_ADDRESS                _UINT32_(0x40004800)                          /* SMB2 Base Address */
#define SMB3_BASE_ADDRESS                _UINT32_(0x40004c00)                          /* SMB3 Base Address */
#define SMB4_BASE_ADDRESS                _UINT32_(0x40005000)                          /* SMB4 Base Address */
#define I2C0_BASE_ADDRESS                _UINT32_(0x40005100)                          /* I2C0 Base Address */
#define I2C1_BASE_ADDRESS                _UINT32_(0x40005200)                          /* I2C1 Base Address */
#define I2C2_BASE_ADDRESS                _UINT32_(0x40005300)                          /* I2C2 Base Address */
#define QMSPI_BASE_ADDRESS               _UINT32_(0x40070000)                          /* QMSPI Base Address */
#define PS2_0_BASE_ADDRESS               _UINT32_(0x40009000)                          /* PS2_0 Base Address */
#define PS2_1_BASE_ADDRESS               _UINT32_(0x40009040)                          /* PS2_1 Base Address */
#define TFDP_BASE_ADDRESS                _UINT32_(0x40008c00)                          /* TFDP Base Address */
#define PORT_80_DEBUG0_BASE_ADDRESS      _UINT32_(0x400f8000)                          /* PORT_80_DEBUG0 Base Address */
#define PORT_80_DEBUG1_BASE_ADDRESS      _UINT32_(0x400f8400)                          /* PORT_80_DEBUG1 Base Address */
#define VCI_BASE_ADDRESS                 _UINT32_(0x4000ae00)                          /* VCI Base Address */
#define VBAT_RAM_BASE_ADDRESS            _UINT32_(0x4000a800)                          /* VBAT_RAM Base Address */
#define VBAT_BASE_ADDRESS                _UINT32_(0x4000a400)                          /* VBAT Base Address */
#define EC_REG_BANK_BASE_ADDRESS         _UINT32_(0x4000fc00)                          /* EC_REG_BANK Base Address */
#define ESPI_SCRATCH_BASE_ADDRESS        _UINT32_(0x400fbc00)                          /* ESPI_SCRATCH Base Address */
#define HDMI_CEC_BASE_ADDRESS            _UINT32_(0x40006800)                          /* HDMI_CEC Base Address */
#define SAFBC_BASE_ADDRESS               _UINT32_(0x40008000)                          /* SAFBC Base Address */
#define SAFCOMM_BASE_ADDRESS             _UINT32_(0x40071000)                          /* SAFCOMM Base Address */
#define SGPIO0_BASE_ADDRESS              _UINT32_(0x4000a000)                          /* SGPIO0 Base Address */
#define SGPIO1_BASE_ADDRESS              _UINT32_(0x4000a100)                          /* SGPIO1 Base Address */
#define SGPIO2_BASE_ADDRESS              _UINT32_(0x4000a200)                          /* SGPIO2 Base Address */
#define SGPIO3_BASE_ADDRESS              _UINT32_(0x4000a300)                          /* SGPIO3 Base Address */
#define OTP_BASE_ADDRESS                 _UINT32_(0x40082000)                          /* OTP Base Address */
#define SPI_SLAVE_BASE_ADDRESS           _UINT32_(0x40007000)                          /* SPI_SLAVE Base Address */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CX0525SG12144                                   */
/* ************************************************************************** */
// Note: Changed for MikroE implementation.
//#include "pio/pic32cx0525sg12144.h"

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CX0525SG12144                        */
/* ************************************************************************** */
#define CODE_SRAM_SIZE                 _UINT32_(0x00038000)    /*  224kB Memory segment type: ram */
#define DATA_SRAM_SIZE                 _UINT32_(0x00008000)    /*   32kB Memory segment type: ram */
#define DATA_SRAM_ALIAS_SIZE           _UINT32_(0x00008000)    /*   32kB Memory segment type: ram */
#define EC_DEVICE_REGISTERS_SIZE       _UINT32_(0x00080000)    /*  512kB Memory segment type: io */
#define GPIO_REGISTERS_SIZE            _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define HOST_DEVICE_REGISTERS_SIZE     _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */
#define CRYPTO_RAM_SIZE                _UINT32_(0x00006000)    /*   24kB Memory segment type: ram */
#define SCS_SIZE                       _UINT32_(0x00001000)    /*    4kB Memory segment type: io */
#define EXTERNAL_FLASH_SIZE            _UINT32_(0x08000000)    /* 131072kB Memory segment type: flash */

#define CODE_SRAM_ADDR                 _UINT32_(0x000e0000)    /* CODE_SRAM base address (type: ram)*/
#define DATA_SRAM_ADDR                 _UINT32_(0x00118000)    /* DATA_SRAM base address (type: ram)*/
#define DATA_SRAM_ALIAS_ADDR           _UINT32_(0x20000000)    /* DATA_SRAM_ALIAS base address (type: ram)*/
#define EC_DEVICE_REGISTERS_ADDR       _UINT32_(0x40000000)    /* EC_DEVICE_REGISTERS base address (type: io)*/
#define GPIO_REGISTERS_ADDR            _UINT32_(0x40080000)    /* GPIO_REGISTERS base address (type: io)*/
#define HOST_DEVICE_REGISTERS_ADDR     _UINT32_(0x400f0000)    /* HOST_DEVICE_REGISTERS base address (type: io)*/
#define CRYPTO_RAM_ADDR                _UINT32_(0x40100000)    /* CRYPTO_RAM base address (type: ram)*/
#define SCS_ADDR                       _UINT32_(0xe000e000)    /* SCS base address (type: io)*/
#define EXTERNAL_FLASH_ADDR            _UINT32_(0x50000000)    /* EXTERNAL_FLASH base address (type: flash)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR PIC32CX0525SG12144                                 */
/* ************************************************************************** */

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR PIC32CX0525SG12144                            */
/* ************************************************************************** */



#ifdef __cplusplus
}
#endif

#endif /* _PIC32CX0525SG12144_H_ */

